# 2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака. Объяснить полученный результат.
# Обьяснение по ссылке
# https://docs.google.com/document/d/1K4GZITib99D4HI2UeYXk9mstp0F2H70Ai9k0Amq4pNE/edit?usp=sharing
print("Результат побитового 'и' для 5 и 6:", 5 & 6)
print("Результат побитового 'или' для 5 и 6:", 5 | 6)
print("Результат побитового 'исключающего или' для 5 и 6:", 5 ^ 6)
print("Результат побитового сдвига влево на 2 символа:", 5 << 2)
print("Результат побитового сдвига вправо на 2 символа:", 5 >> 2)
